using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Sharp_231.Library
{
    public interface IPeriodic
    {
        String GetPeriod();

    }
}
/*
 Інтерфейси
- в цілому - "зміст", зовнішній вигляд класу, декларація
- набір вимог - "контракт", виконання якого робить об'єкт
   належним до функціональнх груп(наприклад: USB-пристрої або періодичні видання)
- в теорії ООП - абстрахтний клас, у якому є лише відкриті, лише абстрактні, лише методи
   (не плутати - у С# можливі порушення всіх вимог для сутності, 
   що описується оператором interface)
- "маркери" - порожні інтерфейси (ез методів взагалі),
   які виокристовуються як дозволи або як належність до групи
- на практиці - оператор мови програмування, що розрізнає різні класи/типи
 */